{
  "backend/main.mo": "Motoko canister implementing user profiles, wallet balances, deposit requests, and admin‑gated review workflows with authorization checks.",
  "feature_evidence.json": "Feature evidence metadata mapping features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose across auth, wallet, admin, store, and layout areas.",
  "frontend/index.css": "Tailwind base styles defining an OKLCH‑based light/dark theme with custom design tokens.",
  "frontend/index.html": "HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router, auth gating, profile setup flow, and route definitions.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown when non‑admins attempt to access admin‑only pages.",
  "frontend/src/components/layout/AppShell.tsx": "App layout with header, navigation, mobile menu, admin links, and footer.",
  "frontend/src/components/LoginButton.tsx": "Button handling Internet Identity login/logout with loading and error recovery.",
  "frontend/src/features/admin/components/DepositApprovalDialog.tsx": "Dialog for admins to review and approve a deposit request with mutation handling and timestamp formatting.",
  "frontend/src/features/auth/components/ProfileSetupDialog.tsx": "Modal that collects and submits a user's display name during initial profile setup.",
  "frontend/src/features/wallet/components/DepositRequestForm.tsx": "Form allowing users to enter an amount and create a deposit request via mutation.",
  "frontend/src/features/wallet/components/DepositRequestsTable.tsx": "Table displaying a user's deposit requests with status badges and timestamps.",
  "frontend/src/features/wallet/components/WalletBalanceCard.tsx": "Card showing the user's current wallet balance or a loading state.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the authenticated/anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identities, and login state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, balances, deposit requests, transactions, and admin checks.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light and dark theme palettes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/admin/AdminDepositsPage.tsx": "Admin interface for viewing, filtering, and approving or rejecting deposit requests with status badges and a dialog.",
  "frontend/src/pages/StorePage.tsx": "Displays the store page showing user balance and a placeholder for future rig packages.",
  "frontend/src/pages/TransactionsPage.tsx": "Fetches and displays the user's transaction history with formatted timestamps, icons, and status badges.",
  "frontend/src/pages/WalletPage.tsx": "Shows wallet balance, deposit request form, deposit requests table, and a link to view transactions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for retrieving, storing, persisting, and clearing URL or session parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and plugin setup.",
  "project_state.json": "JSON file describing the project's current state, architecture, existing features, and pending feature requests."
}