{
  "kind": "build_request",
  "title": "Implement offline bank-transfer deposit credits with admin approval and wallet spending",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement an off-app bank payment deposit flow where users pay the admin outside the app and then request/record a deposit inside the app for admin review.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "it should be like this, the user pays to the admin using bank payment not on this app,  then on payment confirmation admin approves on panel and user uses there credits on the website to make purchase"
        ]
      },
      "acceptanceCriteria": [
        "User can create a deposit request containing at minimum: amount requested, optional payment reference/notes, and timestamp.",
        "Deposit requests are stored in the backend canister and are retrievable by the user (own requests) and by admins (all requests).",
        "Deposit request has a status lifecycle: pending -> approved or rejected.",
        "User cannot directly increase their balance; balance changes only occur via admin approval/credit actions."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an admin panel workflow to confirm bank deposits and credit user wallets by a manually entered amount, with an auditable transaction trail.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "so this means admin inputs how the amount to credit user on the platform!!"
        ]
      },
      "acceptanceCriteria": [
        "Admin can view a list of pending deposit requests and inspect details (user, requested amount, reference/notes, created time).",
        "Admin can approve a deposit request and input the credited amount (may differ from requested amount).",
        "On approval, the user wallet available balance increases by the credited amount.",
        "On rejection, no wallet balance changes occur and the request is marked rejected with an optional admin note/reason.",
        "Every admin credit creates a Transaction record that includes: type (e.g., deposit_credit), user, amount, admin principal, timestamp, and a link to the deposit request (or request id)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update rig/package purchasing to use internal wallet credits (available balance) as the payment method.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "user uses there credits on the website to make purchase"
        ]
      },
      "acceptanceCriteria": [
        "When a user purchases a rig/package, the backend checks the user wallet available balance is sufficient.",
        "On successful purchase, the purchase amount is deducted from available balance and a Transaction record is created (type: rig_purchase or similar).",
        "If balance is insufficient, the purchase is rejected with a clear user-facing error message in English.",
        "User can see updated wallet balance and transaction history after purchase."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Define and enforce admin authorization in the backend for deposit approval and manual wallet crediting actions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "admin approves on panel"
        ]
      },
      "acceptanceCriteria": [
        "Only authorized admin principals can approve/reject deposits and create credits.",
        "Non-admin calls to admin-only methods are rejected.",
        "Admin list/config is stored in the canister state (initial default admin can be configured)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add user-facing pages/components for viewing wallet balance, deposit request status, and transaction history, and admin-facing pages/components for deposit review and approval.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "User UI includes: current available balance, a form to create a deposit request, and a table/list of deposit requests with status.",
        "User UI includes: a transactions list showing deposits and purchases with amounts and timestamps.",
        "Admin UI includes: a deposits queue with filtering by status and an approval dialog where admin enters credited amount and optional note.",
        "All user-facing text is in English and the UI is mobile-first and responsive."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Apply a coherent, distinct visual theme for the RigRewards UI (colors, typography, layout) and enforce it consistently across user and admin areas.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "A single theme direction is implemented consistently across pages (navigation, cards, tables, dialogs, forms).",
        "Theme avoids a default blue/purple-heavy palette unless explicitly required later.",
        "Mobile-first layouts are implemented for key screens (wallet/deposits and admin deposits queue)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Use Internet Identity for authentication (no email/password, no Google OAuth).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose these components instead).",
    "No external databases or third-party payment integrations; bank payments occur خارج the app and are confirmed manually by admins."
  ],
  "nonGoals": [
    "Implementing on-chain ICRC-1 token payments or ledger integrations.",
    "Automated bank transfer verification or integrations with Paystack/Flutterwave/Stripe.",
    "KYC, OTP/SMS verification, push notifications, or real-time chat."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}